# Data Cleaning and Preparation

## Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

 Table 7-1. NA handling methods
 Argument         Description
 dropna           Filter axis labels based on whether values for each label have missing data, with varying thresholds for how 
                  much missing data to tolerate.
 fillna           Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
 isnull           Return boolean values indicating which values are missing/NA.
 notnull          Negation of isnull.

## Filtering Out Missing Data

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))

In [20]:
df.iloc[:4, 1] = NA

In [21]:
df.iloc[:2, 2] = NA

In [22]:
df

          0         1         2
0  1.093354       NaN       NaN
1 -1.271492       NaN       NaN
2 -0.946395       NaN  0.676351
3 -2.125691       NaN -2.254297
4 -0.211558 -1.397163  0.164964
5  2.197068 -0.395225 -0.504893
6  1.155686 -1.028122  0.852362

In [23]:
df.dropna()

          0         1         2
4 -0.211558 -1.397163  0.164964
5  2.197068 -0.395225 -0.504893
6  1.155686 -1.028122  0.852362

In [24]:
df.dropna(thresh=2)

          0         1         2
2 -0.946395       NaN  0.676351
3 -2.125691       NaN -2.254297
4 -0.211558 -1.397163  0.164964
5  2.197068 -0.395225 -0.504893
6  1.155686 -1.028122  0.852362

## Filing In Missing Data

In [25]:
df.fillna(0)

          0         1         2
0  1.093354  0.000000  0.000000
1 -1.271492  0.000000  0.000000
2 -0.946395  0.000000  0.676351
3 -2.125691  0.000000 -2.254297
4 -0.211558 -1.397163  0.164964
5  2.197068 -0.395225 -0.504893
6  1.155686 -1.028122  0.852362

In [26]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.093354  0.500000  0.000000
1 -1.271492  0.500000  0.000000
2 -0.946395  0.500000  0.676351
3 -2.125691  0.500000 -2.254297
4 -0.211558 -1.397163  0.164964
5  2.197068 -0.395225 -0.504893
6  1.155686 -1.028122  0.852362

In [27]:
_ = df.fillna(0, inplace =True)

In [28]:
df

          0         1         2
0  1.093354  0.000000  0.000000
1 -1.271492  0.000000  0.000000
2 -0.946395  0.000000  0.676351
3 -2.125691  0.000000 -2.254297
4 -0.211558 -1.397163  0.164964
5  2.197068 -0.395225 -0.504893
6  1.155686 -1.028122  0.852362

In [29]:
df = pd.DataFrame(np.random.randn(6, 3))

In [30]:
df.iloc[2:, 1] =NA

In [31]:
df.iloc[4: ,2] =NA

In [32]:
df

          0         1         2
0  0.172895  1.103078 -0.807286
1  0.819188 -1.072699  0.930001
2  1.103178       NaN  0.738549
3  1.961496       NaN -2.302002
4 -1.163075       NaN       NaN
5  0.133080       NaN       NaN

In [33]:
df.fillna(method='ffill')

C:\Users\Hemant\AppData\Local\Temp\ipykernel_6456\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  0.172895  1.103078 -0.807286
1  0.819188 -1.072699  0.930001
2  1.103178 -1.072699  0.738549
3  1.961496 -1.072699 -2.302002
4 -1.163075 -1.072699 -2.302002
5  0.133080 -1.072699 -2.302002

In [34]:
df.fillna(method='ffill', limit=2)

C:\Users\Hemant\AppData\Local\Temp\ipykernel_6456\2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0  0.172895  1.103078 -0.807286
1  0.819188 -1.072699  0.930001
2  1.103178 -1.072699  0.738549
3  1.961496 -1.072699 -2.302002
4 -1.163075       NaN -2.302002
5  0.133080       NaN -2.302002

In [35]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [36]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Table 7-2. fillna function arguments
Argument           Description
 value             Scalar value or dict-like object to use to fill missing values
 method            Interpolation; by default 'ffill' if function called with no other arguments
 axis              Axis to fill on; default axis=0
 inplace           Modify the calling object without producing a copy
 limit             For forward and backward filling, maximum number of consecutive periods to fill

## Data Transformation

## Removing Duplicates

In [37]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
'k2': [1, 1, 2, 3, 3, 4, 4]})

In [38]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [41]:
data['v1'] = range(7)

In [42]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data USing a Function or Maping

In [44]:
 data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami','honey ham','nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [45]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
 }

In [47]:
lowercased = data['food'].str.lower()

In [48]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [49]:
data['animal'] = lowercased.map(meat_to_animal)

In [50]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [52]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [53]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [56]:
data.replace([-999, -1000],[np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [58]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                             index=['Ohio', 'Colorado', 'New York'],
                             columns=['one', 'two', 'three', 'four'])

In [59]:
transform = lambda x: x[:4].upper()

In [60]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [61]:
data.index = data.index.map(transform)

In [62]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [63]:
data.rename(index = str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [64]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [65]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [66]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [67]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [69]:
bins = [18, 25, 35, 60, 100]

In [70]:
cats = pd.cut(ages, bins)

In [71]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [72]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [73]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [74]:
pd.value_counts(cats)

C:\Users\Hemant\AppData\Local\Temp\ipykernel_6456\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [75]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [76]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [77]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [78]:
data = np.random.rand(20)

In [79]:
pd.cut(data, 4, precision=2)

[(0.72, 0.95], (0.49, 0.72], (0.72, 0.95], (0.032, 0.26], (0.72, 0.95], ..., (0.032, 0.26], (0.72, 0.95], (0.26, 0.49], (0.49, 0.72], (0.032, 0.26]]
Length: 20
Categories (4, interval[float64, right]): [(0.032, 0.26] < (0.26, 0.49] < (0.49, 0.72] < (0.72, 0.95]]

In [80]:
data = np.random.randn(1000)

In [81]:
cats = pd.qcut(data, 4)

In [82]:
cats

[(-3.017, -0.635], (-0.635, 0.0667], (0.0667, 0.729], (-3.017, -0.635], (-3.017, -0.635], ..., (0.729, 2.833], (0.0667, 0.729], (-0.635, 0.0667], (0.729, 2.833], (0.0667, 0.729]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.017, -0.635] < (-0.635, 0.0667] < (0.0667, 0.729] < (0.729, 2.833]]

In [83]:
pd.value_counts(cats)

C:\Users\Hemant\AppData\Local\Temp\ipykernel_6456\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(-3.017, -0.635]    250
(-0.635, 0.0667]    250
(0.0667, 0.729]     250
(0.729, 2.833]      250
Name: count, dtype: int64

In [85]:
pd.qcut(data,[0, 0.1, 0.5, 0.9, 1.])

[(-1.205, 0.0667], (-1.205, 0.0667], (0.0667, 1.348], (-1.205, 0.0667], (-3.017, -1.205], ..., (1.348, 2.833], (0.0667, 1.348], (-1.205, 0.0667], (0.0667, 1.348], (0.0667, 1.348]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.017, -1.205] < (-1.205, 0.0667] < (0.0667, 1.348] < (1.348, 2.833]]

## Detecting and Filtering Outliers

In [105]:
data = pd.DataFrame(np.random.randn(1000,4))

In [106]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013863    -0.023755     0.004403    -0.055813
std       1.006262     0.953639     1.005095     1.014153
min      -3.433285    -3.523119    -2.911996    -3.289944
25%      -0.653284    -0.682513    -0.649077    -0.745807
50%       0.031604    -0.043787     0.002510    -0.033967
75%       0.716328     0.616631     0.644911     0.615958
max       3.284307     3.437222     3.391750     2.826396

In [107]:
col = data[2]

In [108]:
col[np.abs(col)>3]

388    3.391750
707    3.168019
Name: 2, dtype: float64

In [109]:
data[(np.abs(data) > 3).any(1)]

TypeError: DataFrame.any() takes 1 positional argument but 2 were given

In [110]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [111]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014025    -0.023669     0.003843    -0.055359
std       1.003749     0.950367     1.003333     1.012777
min      -3.000000    -3.000000    -2.911996    -3.000000
25%      -0.653284    -0.682513    -0.649077    -0.745807
50%       0.031604    -0.043787     0.002510    -0.033967
75%       0.716328     0.616631     0.644911     0.615958
max       3.000000     3.000000     3.000000     2.826396

In [113]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0  1.0 -1.0  1.0
3 -1.0 -1.0  1.0  1.0
4  1.0 -1.0 -1.0 -1.0

## Permutation and Random Sampling

In [114]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [115]:
sampler = np.random.permutation(5)

In [116]:
sampler

array([0, 4, 1, 3, 2], dtype=int32)

In [117]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [119]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

In [120]:
df.sample(n=3)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [121]:
choices = pd.Series([5, 7, -1, 6, 4])

In [122]:
draws = choices.sample(n=10, replace=True)

In [123]:
draws

0    5
2   -1
4    4
2   -1
3    6
4    4
4    4
1    7
3    6
4    4
dtype: int64

## Computing Indicator/Dummy Variables

In [127]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1': range(6)})

In [128]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [129]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [130]:
df_with_dummy = df[['data1']].join(dummies)

In [131]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [132]:
mnames = ['movie_id', 'title', 'genres']

## String Manipulation

### String Object Methods

In [134]:
val = 'a,b, guido'

In [135]:
val.split(',')

['a', 'b', ' guido']

In [138]:
pieces=[x.strip() for x in val.split(',')]

In [139]:
pieces

['a', 'b', 'guido']

In [140]:
first, second, third = pieces

In [143]:
first + '::' + second +'::'+ third

'a::b::guido'

In [144]:
'::'.join(pieces)

'a::b::guido'

In [145]:
'guido' in val

True

In [146]:
val.index(',')

1

In [147]:
val.find(':')

-1

In [148]:
val.index(':')

ValueError: substring not found

In [149]:
val.count(',')

2

In [150]:
val.replace(',','::')

'a::b:: guido'

In [151]:
val.replace(',','')

'ab guido'

## Regular Expresion

In [152]:
import re

In [153]:
text = "foo   bar\t baz  \tqux"

In [154]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [156]:
regex = re.compile('\s+')

In [157]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [158]:
regex.findall(text)

['   ', '\t ', '  \t']

In [160]:
text = """Dave dave@google.com
 Steve steve@gmail.com
 Rob rob@gmail.com
 Ryan ryan@yahoo.com
 """
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
 # re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [161]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [162]:
m = regex.search(text)

In [163]:
m

In [164]:
text[m.start():m.end()]

'dave@google.com'

In [165]:
print(regex.match(text))

None

In [166]:
print(regex.sub('REDACTED',text))

Dave REDACTED
 Steve REDACTED
 Rob REDACTED
 Ryan REDACTED

In [173]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [174]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [175]:
m = regex.match('wesm@bright.net')

In [176]:
m.groups()

('wesm', 'bright', 'net')

In [178]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [179]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
 Steve Username: steve, Domain: gmail, Suffix: com
 Rob Username: rob, Domain: gmail, Suffix: com
 Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized String Functions in pandas

In [180]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [181]:
data = pd.Series(data)

In [182]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [183]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [184]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [185]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [186]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [190]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [191]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [192]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!